experimental/glm52_b300_fixed_seq/results/c2-w4a4-20260919/8k1k/w4a4-trtllm/tp4_conc64/benchmark.log
+ run_server_client env PYTHONPATH=/data/home/ziangli/inferencex-glm52-b300/sources/inferencex:/data/home/ziangli/inferencex-glm52-b300/sources/sglang/python:/data/home/ziangli/inferencex-glm52-b300/sources/inferencex python3 -m infx.bench_serving.benchmark_serving --model nvidia/GLM-5.2-NVFP4 --backend vllm --base-url http://0.0.0.0:30000 --dataset-name random --random-input-len 8192 --random-output-len 1024 --random-range-ratio 0.8 --num-prompts 640 --max-concurrency 64 --request-rate inf --ignore-eos --save-result --num-warmups 128 --percentile-metrics ttft,tpot,itl,e2el --result-dir /data/home/ziangli/inferencex-glm52-b300/results/c2-w4a4-20260919/8k1k/w4a4-trtllm/tp4_conc64 --result-filename result.json --use-chat-template --tokenizer /data/home/ziangli/inferencex-glm52-b300/checkpoints/GLM-5.2-NVFP4
+ [[ -n /tmp/inferencex-server-state.Y2sUha ]]
+ PYTHONPATH=/data/home/ziangli/inferencex-glm52-b300/sources/inferencex:/data/home/ziangli/inferencex-glm52-b300/sources/sglang/python:/data/home/ziangli/inferencex-glm52-b300/sources/inferencex
+ python3 -m infx.bench_serving.server_watch run --state /tmp/inferencex-server-state.Y2sUha -- env PYTHONPATH=/data/home/ziangli/inferencex-glm52-b300/sources/inferencex:/data/home/ziangli/inferencex-glm52-b300/sources/sglang/python:/data/home/ziangli/inferencex-glm52-b300/sources/inferencex python3 -m infx.bench_serving.benchmark_serving --model nvidia/GLM-5.2-NVFP4 --backend vllm --base-url http://0.0.0.0:30000 --dataset-name random --random-input-len 8192 --random-output-len 1024 --random-range-ratio 0.8 --num-prompts 640 --max-concurrency 64 --request-rate inf --ignore-eos --save-result --num-warmups 128 --percentile-metrics ttft,tpot,itl,e2el --result-dir /data/home/ziangli/inferencex-glm52-b300/results/c2-w4a4-20260919/8k1k/w4a4-trtllm/tp4_conc64 --result-filename result.json --use-chat-template --tokenizer /data/home/ziangli/inferencex-glm52-b300/checkpoints/GLM-5.2-NVFP4
Namespace(backend='vllm', base_url='http://0.0.0.0:30000', host='127.0.0.1', port=8000, endpoint='/v1/completions', dataset_name='random', dataset_path=None, max_concurrency=64, model='nvidia/GLM-5.2-NVFP4', tokenizer='/data/home/ziangli/inferencex-glm52-b300/checkpoints/GLM-5.2-NVFP4', best_of=1, use_beam_search=False, num_prompts=640, logprobs=None, request_rate=inf, burstiness=1.0, seed=0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=True, save_detailed=False, metadata=None, result_dir='/data/home/ziangli/inferencex-glm52-b300/results/c2-w4a4-20260919/8k1k/w4a4-trtllm/tp4_conc64', result_filename='result.json', ignore_eos=True, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='90,99,99.9', goodput=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=8192, random_output_len=1024, random_range_ratio=0.8, random_prefix_len=0, use_chat_template=True, random_num_workers=0, dsv4=False, hf_subset=None, hf_split=None, hf_output_len=None, tokenizer_mode='auto', served_model_name=None, lora_modules=None, num_warmups=128)
Generating 640 prompts using 8 worker processes...
Prompt generation completed in 9.5s
-------------------  Input/Output Length Statistics  -------------------
 input_lens : min=6556  max=8190  mean=7389.79  avg_token_mismatch=12.00 
 output_lens: min=819   max=1024  mean=921.76  
------------------------------------------------------------------------ 

Starting initial single prompt test run...
Warming up with 128 requests...
100%|██████████| 128/128 [00:58<00:00,  2.18it/s]
Warmup completed.
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 64
  0%|          | 0/640 [00:00<?, ?it/s]Starting main benchmark run...
100%|██████████| 640/640 [04:44<00:00,  2.25it/s]
============ Serving Benchmark Result ============
Successful requests:                     640       
Benchmark duration (s):                  284.49    
Total input tokens:                      4729464   
Total generated tokens:                  589927    
Request throughput (req/s):              2.25      
Output token throughput (tok/s):         2073.63   
Total Token throughput (tok/s):          18697.95  
---------------Time to First Token----------------
Mean TTFT (ms):                          1343.10   
Median TTFT (ms):                        434.08    
P90 TTFT (ms):                           1109.97   
P99 TTFT (ms):                           14729.33  
P99.9 TTFT (ms):                         18587.19  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          29.01     
Median TPOT (ms):                        29.74     
P90 TPOT (ms):                           34.33     
P99 TPOT (ms):                           40.49     
P99.9 TPOT (ms):                         44.16     
---------------Inter-token Latency----------------
Mean ITL (ms):                           2404.82   
Median ITL (ms):                         1631.09   
P90 ITL (ms):                            5337.51   
P99 ITL (ms):                            11190.63  
P99.9 ITL (ms):                          16071.56  
----------------End-to-end Latency----------------
Mean E2EL (ms):                          28051.63  
Median E2EL (ms):                        28031.66  
P90 E2EL (ms):                           34431.39  
P99 E2EL (ms):                           43261.87  
P99.9 E2EL (ms):                         49264.43  
==================================================
+ set +x